In [1]:
import numpy as np
import pandas as pd

In [2]:
#Reading CSV's
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [3]:
train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [4]:
train.describe(include='all')

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
count,8068.000000,8068,7928,8068.000000,7990,7944,7239.000000,8068,7733.000000,7992,8068
unique,NaN,2,2,NaN,2,9,NaN,3,NaN,7,4
top,NaN,Male,Yes,NaN,Yes,Artist,NaN,Low,NaN,Cat_6,D
freq,NaN,4417,4643,NaN,4968,2516,NaN,4878,NaN,5238,2268
mean,463479.214551,NaN,NaN,43.466906,NaN,NaN,2.641663,NaN,2.850123,NaN,NaN
std,2595.381232,NaN,NaN,16.711696,NaN,NaN,3.406763,NaN,1.531413,NaN,NaN
min,458982.000000,NaN,NaN,18.000000,NaN,NaN,0.000000,NaN,1.000000,NaN,NaN
25%,461240.750000,NaN,NaN,30.000000,NaN,NaN,0.000000,NaN,2.000000,NaN,NaN
50%,463472.500000,NaN,NaN,40.000000,NaN,NaN,1.000000,NaN,3.000000,NaN,NaN
75%,465744.250000,NaN,NaN,53.000000,NaN,NaN,4.000000,NaN,4.000000,NaN,NaN
max,467974.000000,NaN,NaN,89.000000,NaN,NaN,14.000000,NaN,9.000000,NaN,NaN

In [5]:
test.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6

In [6]:
test.describe(include='all')

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
count,2627.000000,2627,2577,2627.000000,2603,2589,2358.000000,2627,2514.000000,2595
unique,NaN,2,2,NaN,2,9,NaN,3,NaN,7
top,NaN,Male,Yes,NaN,Yes,Artist,NaN,Low,NaN,Cat_6
freq,NaN,1424,1520,NaN,1602,802,NaN,1616,NaN,1672
mean,463433.918919,NaN,NaN,43.649791,NaN,NaN,2.552587,NaN,2.825378,NaN
std,2618.245698,NaN,NaN,16.967015,NaN,NaN,3.341094,NaN,1.551906,NaN
min,458989.000000,NaN,NaN,18.000000,NaN,NaN,0.000000,NaN,1.000000,NaN
25%,461162.500000,NaN,NaN,30.000000,NaN,NaN,0.000000,NaN,2.000000,NaN
50%,463379.000000,NaN,NaN,41.000000,NaN,NaN,1.000000,NaN,2.000000,NaN
75%,465696.000000,NaN,NaN,53.000000,NaN,NaN,4.000000,NaN,4.000000,NaN
max,467968.000000,NaN,NaN,89.000000,NaN,NaN,14.000000,NaN,9.000000,NaN

In [7]:
# Most test ID's are same as train ID's 

train.ID.isin(test.ID).sum()

2332

In [8]:
# Only 295 rows are new
diff = test.loc[test.ID.isin(train.ID)==False]
diff.shape

(295, 10)

In [9]:
# Merging same test and train ID's

same = pd.merge( test[['ID']] ,  train[['ID','Segmentation']] , on='ID', how ='left' )
same_id = same[same.Segmentation.isnull()]['ID']

new_test= pd.merge(same_id,  test , on='ID', how ='left' )

In [10]:
# Combining train and test

train['train_test'] = 1
new_test['train_test'] = 0

all_data = pd.concat([train,new_test])

In [11]:
all_data.describe(include='all')

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation,train_test
count,8363.000000,8363,8219,8363.000000,8283,8235,7506.000000,8363,8019.000000,8283,8068,8363.000000
unique,NaN,2,2,NaN,2,9,NaN,3,NaN,7,4,NaN
top,NaN,Male,Yes,NaN,Yes,Artist,NaN,Low,NaN,Cat_6,D,NaN
freq,NaN,4579,4807,NaN,5151,2608,NaN,5061,NaN,5418,2268,NaN
mean,463474.382997,NaN,NaN,43.413488,NaN,NaN,2.636824,NaN,2.850231,NaN,NaN,0.964726
std,2597.369734,NaN,NaN,16.729770,NaN,NaN,3.395062,NaN,1.533086,NaN,NaN,0.184484
min,458982.000000,NaN,NaN,18.000000,NaN,NaN,0.000000,NaN,1.000000,NaN,NaN,0.000000
25%,461224.500000,NaN,NaN,30.000000,NaN,NaN,0.000000,NaN,2.000000,NaN,NaN,1.000000
50%,463468.000000,NaN,NaN,40.000000,NaN,NaN,1.000000,NaN,3.000000,NaN,NaN,1.000000
75%,465736.500000,NaN,NaN,53.000000,NaN,NaN,4.000000,NaN,4.000000,NaN,NaN,1.000000
max,467974.000000,NaN,NaN,89.000000,NaN,NaN,14.000000,NaN,9.000000,NaN,NaN,1.000000

In [12]:
all_data.shape

(8363, 12)

In [13]:
# Many null values are there
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married       144
Age                  0
Graduated           80
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [14]:
# Customers whose spending_score is low are likely to be not married

all_data[all_data.Ever_Married == 'Yes'].Spending_Score.value_counts()

Average    2006
Low        1584
High       1217
Name: Spending_Score, dtype: int64

In [15]:
all_data[all_data.Ever_Married == 'No'].Spending_Score.value_counts()

Low    3412
Name: Spending_Score, dtype: int64

In [16]:
all_data.loc[ (pd.isnull(all_data['Ever_Married'])) & (all_data['Spending_Score'] != 'Low'), 'Ever_Married'] = 'Yes'

In [17]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married        65
Age                  0
Graduated           80
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [18]:
all_data[all_data.Ever_Married.isnull()].Spending_Score.value_counts()

Low    65
Name: Spending_Score, dtype: int64

In [19]:
all_data[all_data.Ever_Married.isnull()].Family_Size.value_counts()

1.0    16
3.0    13
4.0    12
2.0    11
6.0     3
5.0     3
7.0     1
8.0     1
Name: Family_Size, dtype: int64

In [20]:
# Customers whose family size is greater than 2 are likely to be married

all_data.loc[ (pd.isnull(all_data['Ever_Married'])) & (all_data['Family_Size'] > 2), 'Ever_Married'] = 'Yes'

In [21]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married        32
Age                  0
Graduated           80
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [22]:
all_data[all_data.Ever_Married == 'No'].Graduated.value_counts()

Yes    1726
No     1655
Name: Graduated, dtype: int64

In [23]:
all_data[all_data.Ever_Married == 'Yes'].Graduated.value_counts()

Yes    3408
No     1462
Name: Graduated, dtype: int64

In [24]:
# Customers who are graduated are mostly married

all_data.loc[ (pd.isnull(all_data['Ever_Married'])) & (all_data['Graduated'] == 'Yes'), 'Ever_Married'] = 'Yes'
all_data.loc[ (pd.isnull(all_data['Ever_Married'])) & (all_data['Graduated'] == 'No'), 'Ever_Married'] = 'No'

In [25]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated           80
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [26]:
all_data[all_data['Graduated']=='Yes'].Profession.value_counts()

Artist           2288
Entertainment     618
Healthcare        490
Doctor            411
Lawyer            398
Engineer          323
Executive         305
Homemaker         143
Marketing         120
Name: Profession, dtype: int64

In [27]:
all_data[all_data['Graduated']=='No'].Profession.value_counts()

Healthcare       880
Engineer         393
Entertainment    357
Artist           305
Executive        302
Doctor           297
Lawyer           238
Marketing        185
Homemaker        109
Name: Profession, dtype: int64

In [28]:
# From above an Artist is most likely to be graduated than any other

all_data.loc[ (pd.isnull(all_data['Graduated'])) & (all_data['Profession'] == 'Artist'), 'Graduated'] = 'Yes'

In [29]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated           65
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [30]:
all_data[all_data['Graduated']=='Yes'].Ever_Married.value_counts()

Yes    3435
No     1731
Name: Ever_Married, dtype: int64

In [31]:
all_data[all_data['Graduated']=='No'].Ever_Married.value_counts()

No     1670
Yes    1462
Name: Ever_Married, dtype: int64

In [32]:
# Ones who are married are likely to be graduated

all_data.loc[ (pd.isnull(all_data['Graduated'])) & (all_data['Ever_Married'] == 'Yes'), 'Graduated'] = 'Yes'
all_data.loc[ (pd.isnull(all_data['Graduated'])) & (all_data['Ever_Married'] == 'No'), 'Graduated'] = 'No'

In [33]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession         128
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [34]:
all_data[all_data['Spending_Score']=='High'].Profession.value_counts()

Executive        408
Lawyer           339
Artist           250
Engineer          62
Entertainment     47
Healthcare        46
Marketing         35
Doctor            33
Homemaker         27
Name: Profession, dtype: int64

In [35]:
all_data[all_data['Spending_Score']=='Low'].Profession.value_counts()

Artist           1314
Healthcare       1294
Entertainment     607
Doctor            494
Engineer          430
Lawyer            291
Marketing         256
Homemaker         165
Executive         128
Name: Profession, dtype: int64

In [36]:
all_data[all_data['Spending_Score']=='Average'].Profession.value_counts()

Artist           1044
Entertainment     333
Engineer          228
Doctor            186
Executive          76
Homemaker          62
Healthcare         42
Marketing          19
Lawyer             19
Name: Profession, dtype: int64

In [37]:
# Artist spend average and executive spend high

all_data.loc[ (pd.isnull(all_data['Profession'])) & (all_data['Spending_Score'] == 'Average'), 'Profession'] = 'Artist'
all_data.loc[ (pd.isnull(all_data['Profession'])) & (all_data['Spending_Score'] == 'High'), 'Profession'] = 'Executive'

In [38]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession          82
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [39]:
for i in ['Cat_1','Cat_2','Cat_3','Cat_4','Cat_5','Cat_6']:
    print(i)
    print(all_data[all_data['Var_1']==i].Profession.value_counts())

Cat_1
Artist           36
Healthcare       26
Entertainment    17
Executive        13
Doctor           11
Lawyer           10
Engineer          8
Marketing         8
Homemaker         4
Name: Profession, dtype: int64
Cat_2
Healthcare       131
Artist           127
Entertainment     61
Doctor            44
Engineer          23
Executive         20
Homemaker         13
Marketing         10
Lawyer            10
Name: Profession, dtype: int64
Cat_3
Artist           214
Healthcare       152
Entertainment    129
Engineer          93
Doctor            80
Marketing         54
Homemaker         52
Executive         36
Lawyer            31
Name: Profession, dtype: int64
Cat_4
Artist           227
Healthcare       219
Engineer         210
Entertainment    139
Doctor           108
Executive         92
Marketing         52
Lawyer            36
Homemaker         29
Name: Profession, dtype: int64
Cat_5
Artist           24
Healthcare       23
Entertainment    11
Engineer          9
Homemaker         7
Marketing         6
Doctor            4
Lawyer            3
Executive         2
Name: Profession, dtype: int64
Cat_6
Artist           1919
Healthcare        766
Entertainment     602
Lawyer            552
Executive         444
Doctor            435
Engineer          354
Marketing         166
Homemaker         144
Name: Profession, dtype: int64

In [40]:
#  Most Artist fall in Category6

all_data.loc[ (pd.isnull(all_data['Profession'])) & (all_data['Var_1'] == 'Cat_6'), 'Profession'] = 'Artist'

In [41]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession          46
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [42]:
for i in range(1,10):
    print(i)
    print(all_data[all_data['Family_Size']==i].Profession.value_counts())

1
Artist           599
Lawyer           188
Entertainment    159
Engineer         155
Doctor           118
Healthcare        99
Homemaker         92
Marketing         57
Executive         29
Name: Profession, dtype: int64
2
Artist           967
Lawyer           342
Entertainment    330
Doctor           214
Healthcare       169
Engineer         168
Executive        156
Marketing         64
Homemaker         59
Name: Profession, dtype: int64
3
Artist           470
Healthcare       327
Entertainment    189
Executive        144
Doctor           143
Engineer         133
Marketing         59
Lawyer            53
Homemaker         30
Name: Profession, dtype: int64
4
Healthcare       389
Artist           368
Executive        162
Entertainment    157
Doctor           122
Engineer         115
Marketing         58
Homemaker         27
Lawyer            19
Name: Profession, dtype: int64
5
Healthcare       201
Artist           126
Executive         75
Entertainment     72
Engineer          66
Doctor            53
Marketing         30
Lawyer             7
Homemaker          5
Name: Profession, dtype: int64
6
Healthcare       66
Artist           42
Engineer         27
Doctor           23
Entertainment    23
Executive        17
Marketing        14
Homemaker         4
Lawyer            2
Name: Profession, dtype: int64
7
Healthcare       31
Artist           19
Engineer         17
Executive        12
Entertainment     7
Doctor            5
Homemaker         4
Marketing         2
Lawyer            1
Name: Profession, dtype: int64
8
Healthcare       20
Artist            8
Engineer          8
Entertainment     6
Doctor            4
Executive         3
Marketing         2
Name: Profession, dtype: int64
9
Healthcare       9
Executive        8
Artist           6
Engineer         5
Doctor           5
Marketing        5
Lawyer           4
Entertainment    3
Homemaker        1
Name: Profession, dtype: int64

In [43]:
# Most artists have family size =1 and healthcare people have family size =5

all_data.loc[ (pd.isnull(all_data['Profession'])) & (all_data['Family_Size'] == 1), 'Profession'] = 'Artist'
all_data.loc[ (pd.isnull(all_data['Profession'])) & (all_data['Family_Size'] == 5), 'Profession'] = 'Healthcare'

In [45]:
# Filling remaining Profession missing values using ffill method

all_data.Profession.fillna(method='ffill',inplace=True)

In [46]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience    857
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [47]:
for i in ['Healthcare', 'Engineer', 'Lawyer', 'Entertainment', 'Artist','Executive', 'Doctor', 'Homemaker', 'Marketing']:
    print(i)
    print(all_data[all_data.Profession == i]['Work_Experience'].median())

Healthcare
1.0
Engineer
1.0
Lawyer
1.0
Entertainment
1.0
Artist
1.0
Executive
1.0
Doctor
1.0
Homemaker
8.0
Marketing
1.0

In [48]:
# Filling work experience as per Profession

all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Healthcare'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Engineer'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Lawyer'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Entertainment'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Artist'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Executive'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Doctor'), 'Work_Experience'] = 1
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Homemaker'), 'Work_Experience'] = 8
all_data.loc[ (pd.isnull(all_data['Work_Experience'])) & (all_data['Profession'] == 'Marketing'), 'Work_Experience'] = 1

In [49]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience      0
Spending_Score       0
Family_Size        344
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [52]:
# If not married family size 1 in general

all_data.loc[ (pd.isnull(all_data['Family_Size'])) & (all_data['Ever_Married'] == 'No'), 'Family_Size'] = 1

In [53]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience      0
Spending_Score       0
Family_Size        152
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [57]:
all_data[all_data['Spending_Score']=='High'].Family_Size.value_counts()

2.0    606
3.0    239
4.0    219
5.0     91
6.0     26
1.0     18
7.0     13
9.0     11
8.0      6
Name: Family_Size, dtype: int64

In [58]:
all_data[all_data['Spending_Score']=='Low'].Family_Size.value_counts()

1.0    1676
2.0    1025
3.0     846
4.0     764
5.0     375
6.0     146
7.0      71
8.0      40
9.0      28
Name: Family_Size, dtype: int64

In [59]:
all_data[all_data['Spending_Score']=='Average'].Family_Size.value_counts()

2.0    847
3.0    468
4.0    440
5.0    172
6.0     48
7.0     16
9.0      7
1.0      7
8.0      6
Name: Family_Size, dtype: int64

In [61]:
# Family size =1 means spending score will be low

all_data.loc[ (pd.isnull(all_data['Family_Size'])) & (all_data['Spending_Score'] == 'Low'), 'Family_Size'] = 1

In [63]:
# Replacing leftover missing values of Family size =2

all_data.loc[ (pd.isnull(all_data['Family_Size'])) & (all_data['Ever_Married'] == 'Yes'), 'Family_Size'] = 2

In [64]:
all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience      0
Spending_Score       0
Family_Size          0
Var_1               80
Segmentation       295
train_test           0
dtype: int64

In [65]:
# Filling remaining Var_1 missing values using ffill method

all_data.Var_1.fillna(method='ffill',inplace=True)

In [66]:
# No null values remaining now

all_data.isnull().sum()

ID                   0
Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience      0
Spending_Score       0
Family_Size          0
Var_1                0
Segmentation       295
train_test           0
dtype: int64

In [67]:
all_data.shape

(8363, 12)

In [69]:
train_data = all_data.loc[all_data['train_test']==1]

In [70]:
train_data.shape

(8068, 12)

In [71]:
test_data = all_data.loc[all_data['train_test']==0]

In [72]:
test_data.shape

(295, 12)

In [74]:
test_data = test_data.drop(['Segmentation'],axis=1)

In [75]:
test_data.shape

(295, 11)

In [77]:
train_data.to_csv('train_cleaned.csv',index=False)
test_data.to_csv('test_cleaned.csv',index=False)